#+STARTUP: showall indent hidestars

MFM - Minimal Forth Machine

* Parsing of Abstract Assembler Code

Этот кусок кода разбирает минимальный сниппет кода на "абстрактном
ассемблере", чтобы получить из него список S-выражений

#+NAME: p_aasm
#+BEGIN_SRC elisp :var arg=min_aasm :results output
  (defun p-aasm (param)
    (block ram
      (if (or (string-equal "" param)
              (string-equal "" (string-trim-left param)))
          (return-from ram `(:empty))
        (let* ((out   `(:ident ,(- (length param) (length (string-trim-left param)))))
               (param     (string-trim-left param))
               (reg-size  4)
               (reg     "\\(%[a-z]\\{3\\}\\)"))
          (replace-regexp-in-string
           "^#\\(.*\\)" ;; comment-line
           (lambda (in)
             (setf out (append out `(:comment-line ,in)))
             (return-from ram out))
           param)
          (save-match-data ;; mov reg to reg
            (and (string-match (concat "^mov\s*" reg "\s*,\s*" reg "\\(.*\\)") param)
                 (return-from ram
                   (append out `(:cmd :mov_reg_to_reg :from ,(match-string 1 param)
                                      :to   ,(match-string 2 param)
                                      :rest ,(match-string 3 param))))))
          (save-match-data ;; mov mem to reg
            (and (string-match (concat "^mov\s*(" reg ")\s*,\s*" reg "\\(.*\\)") param)
                 (return-from ram
                   (append out `(:cmd :mov_mem_to_reg :from ,(match-string 1 param)
                                      :to   ,(match-string 2 param)
                                      :rest ,(match-string 3 param))))))
          (save-match-data ;; mov reg to mem
            (and (string-match (concat "^mov\s*" reg "\s*,\s*(" reg ")\\(.*\\)") param)
                 (return-from ram
                   (append out `(:cmd :mov_reg_to_mem :from ,(match-string 1 param)
                                      :to   ,(match-string 2 param)
                                      :rest ,(match-string 3 param))))))
          (save-match-data ;; jmp reg
            (and (string-match (concat "^jmp\s*" reg "\\(.*\\)?$") param)
                 (return-from ram
                   (append out `(:cmd :jmp_reg
                                      :to ,(car (split-string (match-string 1 param)))
                                      :rest ,(match-string 2 param))))))
          (save-match-data ;; jmp label
            (and (string-match
                  (concat "^jmp\s*" "\\([_a-zA-z]+\\)" "\s?\\(.*\\)?$") param)
                 (return-from ram
                   (append out `(:cmd :jmp_label
                                      :to ,(car (split-string (match-string 1 param)))
                                      :rest ,(match-string 2 param))))))
          (save-match-data ;; label
            (and (string-match
                  (concat "^\\([_a-zA-z]+\\):" "\s?\\(.*\\)?$") param)
                 (return-from ram
                   (append out `(:cmd :label
                                      :name ,(car (split-string (match-string 1 param)))
                                      :rest ,(match-string 2 param))))))
          ))))

  (mapcar #'(lambda (in) (princ "\n") (prin1 in))
          (mapcar #'p-aasm
                  (split-string arg "\n" nil nil)))
#+END_SRC

#+results: p_aasm
#+begin_example

(:empty)
(:ident 0 :comment-line "# FIRST COMMENT")
(:ident 2 :comment-line "# COMMENT WITH INDENTATION")
(:ident 4 :cmd :mov_reg_to_reg :from "%IPR" :to "%ACR" :rest "     # mov reg to reg")
(:ident 4 :cmd :mov_reg_to_reg :from "%IPR" :to "%ACR" :rest "")
(:ident 4 :cmd :mov_mem_to_reg :from "%IPR" :to "%ACR" :rest "   # mov mem to reg")
(:ident 4 :cmd :mov_mem_to_reg :from "%IPR" :to "%ACR" :rest "")
(:ident 4 :cmd :mov_reg_to_mem :from "%IPR" :to "%ACR" :rest "   # mov reg to mem")
(:ident 4 :cmd :mov_reg_to_mem :from "%IPR" :to "%ACR" :rest "")
(:ident 4 :cmd :jmp_reg :to "%IRP" :rest "           # jmp reg")
(:ident 4 :cmd :jmp_reg :to "%IRP" :rest "")
(:ident 4 :cmd :jmp_label :to "_label" :rest "        # jmp label")
(:ident 4 :cmd :jmp_label :to "_label" :rest "")
(:ident 0 :cmd :label :name "_label_with_comment" :rest "      # this is label")
(:ident 0 :cmd :label :name "_label" :rest "")
(:empty)
#+end_example

